In [1]:
person = {
    'first': "Yehya",
    'last': 'Ali',
    'email': 'y@gmail.com'
}

In [2]:
people = {
    'first': ["Yehya", "Alaa", "Ebrahim"],
    'last': ['Ali', "Mohamed", "Ali"],
    'email': ['y@gmail.com', 'a@gmail.com', 'e@gmail.com']
}

In [3]:
people['email']

['y@gmail.com', 'a@gmail.com', 'e@gmail.com']

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame(people)

In [6]:
df

     first     last        email
0    Yehya      Ali  y@gmail.com
1     Alaa  Mohamed  a@gmail.com
2  Ebrahim      Ali  e@gmail.com

In [7]:
df['first']

0      Yehya
1       Alaa
2    Ebrahim
Name: first, dtype: object

In [8]:
type(df['first'])

pandas.core.series.Series

In [9]:
df[ ['first', 'last'] ]

     first     last
0    Yehya      Ali
1     Alaa  Mohamed
2  Ebrahim      Ali

In [10]:
type(df[ ['first', 'last'] ])

pandas.core.frame.DataFrame

In [11]:
df.email

0    y@gmail.com
1    a@gmail.com
2    e@gmail.com
Name: email, dtype: object

In [12]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [13]:
df

     first     last        email
0    Yehya      Ali  y@gmail.com
1     Alaa  Mohamed  a@gmail.com
2  Ebrahim      Ali  e@gmail.com

In [14]:
df.iloc[0]

first          Yehya
last             Ali
email    y@gmail.com
Name: 0, dtype: object

In [15]:
df.iloc[ [0, 1] ]

   first     last        email
0  Yehya      Ali  y@gmail.com
1   Alaa  Mohamed  a@gmail.com

In [16]:
df.iloc[ [0, 1], 2 ]

0    y@gmail.com
1    a@gmail.com
Name: email, dtype: object

In [17]:
df.iloc[ [0, 1], [0, 1] ]

   first     last
0  Yehya      Ali
1   Alaa  Mohamed

In [18]:
df

     first     last        email
0    Yehya      Ali  y@gmail.com
1     Alaa  Mohamed  a@gmail.com
2  Ebrahim      Ali  e@gmail.com

In [19]:
df.loc[0]

first          Yehya
last             Ali
email    y@gmail.com
Name: 0, dtype: object

In [20]:
df.loc[ [0, 1] ]

   first     last        email
0  Yehya      Ali  y@gmail.com
1   Alaa  Mohamed  a@gmail.com

In [21]:
df.loc[ [0, 1], 'email' ]

0    y@gmail.com
1    a@gmail.com
Name: email, dtype: object

In [22]:
df.loc[ [0, 1], ['email', 'first'] ]

         email  first
0  y@gmail.com  Yehya
1  a@gmail.com   Alaa

In [23]:
df

     first     last        email
0    Yehya      Ali  y@gmail.com
1     Alaa  Mohamed  a@gmail.com
2  Ebrahim      Ali  e@gmail.com

In [24]:
df['email']

0    y@gmail.com
1    a@gmail.com
2    e@gmail.com
Name: email, dtype: object

In [25]:
df.iloc[0, 2]

'y@gmail.com'

In [26]:
df.loc[0, 'email']

'y@gmail.com'

In [27]:
df

     first     last        email
0    Yehya      Ali  y@gmail.com
1     Alaa  Mohamed  a@gmail.com
2  Ebrahim      Ali  e@gmail.com

In [28]:
df.set_index('email', inplace=True)

In [29]:
df.iloc[0]

first    Yehya
last       Ali
Name: y@gmail.com, dtype: object

In [30]:
df.loc['y@gmail.com']

first    Yehya
last       Ali
Name: y@gmail.com, dtype: object

In [31]:
df

               first     last
email
y@gmail.com    Yehya      Ali
a@gmail.com     Alaa  Mohamed
e@gmail.com  Ebrahim      Ali

In [32]:
df.reset_index()

         email    first     last
0  y@gmail.com    Yehya      Ali
1  a@gmail.com     Alaa  Mohamed
2  e@gmail.com  Ebrahim      Ali

In [33]:
df.reset_index(inplace=True)

In [34]:
df

         email    first     last
0  y@gmail.com    Yehya      Ali
1  a@gmail.com     Alaa  Mohamed
2  e@gmail.com  Ebrahim      Ali

In [35]:
filt = df['first'] == 'Yehya'

In [36]:
df[filt]

         email  first last
0  y@gmail.com  Yehya  Ali

In [37]:
df.loc[filt]

         email  first last
0  y@gmail.com  Yehya  Ali

In [38]:
df.loc[filt, 'email']

0    y@gmail.com
Name: email, dtype: object

In [39]:
df

         email    first     last
0  y@gmail.com    Yehya      Ali
1  a@gmail.com     Alaa  Mohamed
2  e@gmail.com  Ebrahim      Ali

In [40]:
filt = (df['first'] == 'Yehya') & (df['last'] == 'Ali')

In [41]:
df.loc[filt, 'email']

0    y@gmail.com
Name: email, dtype: object

In [42]:
df.loc[~filt, 'email']

1    a@gmail.com
2    e@gmail.com
Name: email, dtype: object

In [43]:
filt = (df['first'] == 'Yehya') | (df['first'] == 'Alaa')

In [44]:
df.loc[filt, 'email']

0    y@gmail.com
1    a@gmail.com
Name: email, dtype: object

In [45]:
df

         email    first     last
0  y@gmail.com    Yehya      Ali
1  a@gmail.com     Alaa  Mohamed
2  e@gmail.com  Ebrahim      Ali

In [46]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [47]:
df.columns = ['first name', 'last name', 'the email']

In [48]:
df

    first name last name the email
0  y@gmail.com     Yehya       Ali
1  a@gmail.com      Alaa   Mohamed
2  e@gmail.com   Ebrahim       Ali

In [49]:
df.columns = ['first name'.upper(), 'last name', 'the email']

In [50]:
df

    FIRST NAME last name the email
0  y@gmail.com     Yehya       Ali
1  a@gmail.com      Alaa   Mohamed
2  e@gmail.com   Ebrahim       Ali

In [51]:
df.columns = [ x.upper() for x in df.columns ]

In [52]:
df

    FIRST NAME LAST NAME THE EMAIL
0  y@gmail.com     Yehya       Ali
1  a@gmail.com      Alaa   Mohamed
2  e@gmail.com   Ebrahim       Ali

In [53]:
df.columns = [ x.lower() for x in df.columns ]

In [54]:
df

    first name last name the email
0  y@gmail.com     Yehya       Ali
1  a@gmail.com      Alaa   Mohamed
2  e@gmail.com   Ebrahim       Ali

In [55]:
df['first name']

0    y@gmail.com
1    a@gmail.com
2    e@gmail.com
Name: first name, dtype: object

In [56]:
df.columns = df.columns.str.replace(' ', '_')

In [57]:
df

    first_name last_name the_email
0  y@gmail.com     Yehya       Ali
1  a@gmail.com      Alaa   Mohamed
2  e@gmail.com   Ebrahim       Ali

In [58]:
df.first_name

0    y@gmail.com
1    a@gmail.com
2    e@gmail.com
Name: first_name, dtype: object

In [59]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [60]:
df

         first     last the_email
0  y@gmail.com    Yehya       Ali
1  a@gmail.com     Alaa   Mohamed
2  e@gmail.com  Ebrahim       Ali

In [61]:
df.loc[0] = ['Ahmad', 'Mohamed', 'ah@gmail.com']

In [62]:
df

         first     last     the_email
0        Ahmad  Mohamed  ah@gmail.com
1  a@gmail.com     Alaa       Mohamed
2  e@gmail.com  Ebrahim           Ali

In [63]:
df.loc[2, 'the_email'] = 'eee@gmail.com'

In [64]:
df

         first     last      the_email
0        Ahmad  Mohamed   ah@gmail.com
1  a@gmail.com     Alaa        Mohamed
2  e@gmail.com  Ebrahim  eee@gmail.com

In [65]:
df['the_email'] = df['the_email'].str.upper()

In [66]:
df

         first     last      the_email
0        Ahmad  Mohamed   AH@GMAIL.COM
1  a@gmail.com     Alaa        MOHAMED
2  e@gmail.com  Ebrahim  EEE@GMAIL.COM

In [67]:
df['the_email'] = df['the_email'].str.lower()

In [68]:
df

         first     last      the_email
0        Ahmad  Mohamed   ah@gmail.com
1  a@gmail.com     Alaa        mohamed
2  e@gmail.com  Ebrahim  eee@gmail.com

In [69]:
df['the_email'] = ['a@gmail.com', 'a@gmail.com', 'e@gmail.com']

In [70]:
df

         first     last    the_email
0        Ahmad  Mohamed  a@gmail.com
1  a@gmail.com     Alaa  a@gmail.com
2  e@gmail.com  Ebrahim  e@gmail.com

In [71]:
df.columns = ['first', 'last', 'email']

In [72]:
df

         first     last        email
0        Ahmad  Mohamed  a@gmail.com
1  a@gmail.com     Alaa  a@gmail.com
2  e@gmail.com  Ebrahim  e@gmail.com

In [73]:
df['email'].apply(len)

0    11
1    11
2    11
Name: email, dtype: int64

In [74]:
def update_email(email):
    return email.upper()

In [75]:
df['email'] = df['email'].apply(update_email)

In [76]:
df

         first     last        email
0        Ahmad  Mohamed  A@GMAIL.COM
1  a@gmail.com     Alaa  A@GMAIL.COM
2  e@gmail.com  Ebrahim  E@GMAIL.COM

In [77]:
df['email'] = df['email'].apply(lambda x : x.lower())

In [78]:
df

         first     last        email
0        Ahmad  Mohamed  a@gmail.com
1  a@gmail.com     Alaa  a@gmail.com
2  e@gmail.com  Ebrahim  e@gmail.com

In [79]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [80]:
df.applymap(len)

   first  last  email
0      5     7     11
1     11     4     11
2     11     7     11

In [81]:
df.applymap(str.upper)

         first     last        email
0        AHMAD  MOHAMED  A@GMAIL.COM
1  A@GMAIL.COM     ALAA  A@GMAIL.COM
2  E@GMAIL.COM  EBRAHIM  E@GMAIL.COM

In [82]:
df.applymap(str.lower)

         first     last        email
0        ahmad  mohamed  a@gmail.com
1  a@gmail.com     alaa  a@gmail.com
2  e@gmail.com  ebrahim  e@gmail.com

In [83]:
df['first'].map({'ahmad': 'mona'})

0    NaN
1    NaN
2    NaN
Name: first, dtype: object

In [84]:
df

         first     last        email
0        Ahmad  Mohamed  a@gmail.com
1  a@gmail.com     Alaa  a@gmail.com
2  e@gmail.com  Ebrahim  e@gmail.com

In [85]:
df['first'].map({'Ahmad': 'mona'})

0    mona
1     NaN
2     NaN
Name: first, dtype: object

In [86]:
df['first'].replace({'Ahmad': 'mona'})

0           mona
1    a@gmail.com
2    e@gmail.com
Name: first, dtype: object

In [111]:
df

     first     last        email
0    Yehya      Ali  y@gmail.com
1     Alaa  Mohamed  a@gmail.com
2  Ebrahim      Ali  e@gmail.com

In [114]:
df['full_name'] = df['first'] + ' ' + df['last']

In [115]:
df

     first     last        email     full_name
0    Yehya      Ali  y@gmail.com     Yehya Ali
1     Alaa  Mohamed  a@gmail.com  Alaa Mohamed
2  Ebrahim      Ali  e@gmail.com   Ebrahim Ali

In [118]:
df.drop(columns=['first', 'last'], inplace=True)

In [119]:
df

         email     full_name
0  y@gmail.com     Yehya Ali
1  a@gmail.com  Alaa Mohamed
2  e@gmail.com   Ebrahim Ali

In [125]:
df.append({'email': 'm@gmail.com', 'full_name': 'Mazen Mazen'}, ignore_index=True)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_13560\403430890.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'email': 'm@gmail.com', 'full_name': 'Mazen Mazen'}, ignore_index=True)

         email     full_name
0  y@gmail.com     Yehya Ali
1  a@gmail.com  Alaa Mohamed
2  e@gmail.com   Ebrahim Ali
3  m@gmail.com   Mazen Mazen

In [127]:
df.concat({'email': 'm@gmail.com', 'full_name': 'Mazen Mazen'})

AttributeError: 'DataFrame' object has no attribute 'concat'

In [128]:
df

         email     full_name
0  y@gmail.com     Yehya Ali
1  a@gmail.com  Alaa Mohamed
2  e@gmail.com   Ebrahim Ali